{
	"meta": {
		"favicon": {
			"image": "assets/images/favicon.svg",
			"type": "image/svg+xml"
		}
	},
    "basics": {
        "name": "James Shaver",
        "label": "Senior Technical Account Manager",
        "url": "https://jshaver.me",
        "image": "assets/images/profile.png",
        "email": "contact@jshaver.me",
        "phone": "(503)610-0832",
        "website": "https://jshaver.me",
        "summary": "Organized and goal-oriented, fully committed to providing the highest possible standards of customer service and support. Analytical problem-solver, able to anticipate issues and define processes to resolve concerns and improve efficiency. Highly skilled in building client / team member relationships. Able to see the big picture, delegate effectively and motivate team members to achieve project completion on time. ",
        "location": {
            "address": "",
            "postalCode": "97132",
            "city": "Newberg",
            "countryCode": "US",
            "region": "Oregon"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "jamesdshaver",
                "url": "https://www.linkedin.com/in/jamesdshaver"
            },
            {
                "network": "GitHub",
                "username": "shavertech",
                "url": "https://codepen.io/shavertech"
            },
            {
                "network": "CodePen",
                "username": "JamesShaver",
                "url": "https://github.com/JamesShaver"
            },
            {
                "network": "StackOverflow",
                "username": "James",
                "url": "https://stackoverflow.com/users/2844703/james"
            }
        ]
    },
    "work": [
        {
            "name": "Docusign",
            "url": "https://docusign.com",
            "location": "Portland, Oregon",
            "position": "Senior Technical Account Manager (Sr. TAM)",
            "startDate": "2023-03-01",
            "highlights": [
                "Technical Relationship Management: Managed and cultivated technical relationships with Enterprise Premier accounts, acting as the primary technical contact and ensuring overall account health.",
                "Issue Resolution & Advocacy: Led resolution efforts for complex production issues, including escalations, system testing, and strategic planning. Represented customer needs within DocuSign to advocate for prioritization of requests in release cycles.",
                "Cross-Functional Collaboration: Partnered with internal teams such as Engineering, Product Management, Sales, and Professional Services to drive customer adoption, loyalty, and satisfaction.",
                "Proactive Recommendations: Delivered tailored technical recommendations, including training and insights on advanced features, APIs, and deployment strategies.",
                "Operational Metrics Excellence: Consistently achieved Service Level Agreement and Customer Satisfaction (CSAT) targets by effectively managing incidents and fostering engagement.",
                "Leadership & Mentorship: Inspired colleagues and provided mentorship while championing strategic improvements and promoting the Enterprise Premier Support program.",
                "Technical Expertise: Leveraged expertise in Docusign integrations (e.g., Salesforce, SharePoint), products (Connect, PowerForms, API), and technologies (XML/JSON, REST/SOAP APIs, HTML, CSS, Node.js) to tackle diverse technical challenges."
            ]
        },
        {
            "name": "TalentNet",
            "position": "Customer Success Engineer",
            "url": "https://talentnet.com",
            "startDate": "2021-04-01",
            "endDate": "2023-03-01",
            "highlights": [
                "Customer Lifecycle Management: Oversaw key technical areas, including API development, job board integration, and personalized support for diverse customer accounts.",
                "Technical Advisory Role: Served as a technical resource, providing expertise and guidance to external customers and internal stakeholders alike.",
                "Scalable Solution Design: Strategized and identified new use cases to simplify processes and deliver scalable solutions across the customer base.",
                "Cross-Functional Engagement: Collaborated with product, software engineering, and UX teams to guide customer requests and define roadmap priorities.",
                "Resolution Leadership: Coordinated closely with technical support teams to ensure timely resolution of customer requests and escalations.",
                "Advocacy and Mentorship: Acted as a customer advocate while fostering team collaboration and providing mentorship to fellow team members."
            ]
        },
        {
            "name": "fiserv",
            "position": "Client Technical Support Engineer",
            "url": "https://fiserv.com",
            "startDate": "2017-05-01",
            "endDate": "2021-03-01",
            "highlights": [
                "Leadership & Expertise: Served as a team leader and Subject Matter Expert (SME) for the DadePay project, driving training exercises and Knowledgebase article development.",
                "Support Model Development: Designed, implemented, and maintained the DadePay support model and client readiness documentation, ensuring 100% readiness for initial client requests.",
                "Cross-Functional Collaboration: Engaged with Development and Product teams to increase visibility into client activity, gather feedback, and address recurring themes to improve quality and reduce case activity.",
                "Comprehensive Product Support: Provided assistance to clients across all aspects of the various products managed by FRMS.",
                "Virtual Environment Maintenance: Oversaw the team's client virtual machine pool to ensure availability of client models for testing in comparable environments."
            ]
        },
        {
            "name": "Nuscale Power",
            "position": "HRIS Consultant",
            "url": "https://www.nuscalepower.com",
            "startDate": "2016-08-01",
            "endDate": "2017-05-01",
            "highlights": [
                "Project Management: Developed and managed five benefit carrier integration projects, from initial design to post-implementation support.",
                "Application Development: Designed a simplified application for delivering benefit files to carriers, featuring a single-click menu for file generation, delivery via SFTP, and date-stamped archiving on a secured network drive.",
                "File Auditing & Coordination: Audited files and coordinated efforts with benefit carrier EDI specialists and NuScale team members.",
                "Automation & Custom Coding: Developed and maintained custom code to automate WorkForceReady for reporting and delivery needs.",
                "Technical Support: Served as the point person for all Kronos WorkforceReady issues, assisting employees in running reports, understanding workflows, auditing security/group access, and creating tickets as needed."
            ]
        },
        {
            "name": "BBSI",
            "position": "Application Support",
            "url": "https://www.bbsi.com",
            "startDate": "2015-11-01",
            "endDate": "2016-02-01",
            "highlights": [
                "Provided first-line technical support for branch users across various platforms including HRPyramid, Salesforce, and SpringCM."
            ]
        },
        {
            "name": "ADP",
            "url": "https://adp.com",
            "roles": [
                {
                    "position": "Senior Connections Support Specialist",
                    "startDate": "2013-10-01",
                    "endDate": "2015-08-01",
                    "highlights": [
                        "File Integration Support: Worked with HR/Benefits and WorkforceNow service teams to enable payroll and benefit enrollment connection files.",
                        "Technical Training & Support: Provided training and technical support for the integration between ADP HR/Benefits, WorkforceNow, Payroll products, and benefit carriers.",
                        "Collaboration with EDI Teams: Developed strong relationships with benefit carrier EDI teams, facilitating smoother connection changes.",
                        "Data File Delivery: Maintained delivery of data files in various formats (XML, JSON, ANSI834 4010/5010, CSV, Tab Delimited) between ADP HR/Benefits and benefit providers to ensure accurate employee benefit plan enrollment.",
                        "Client Communications: Ensured effective communication with clients, fostering satisfaction and improving retention rates.",
                        "Issue Resolution: Identified technical issues, replicated errors, and developed effective workarounds.",
                        "Training & Procedure Development: Trained associates and created new procedures to enhance team efficiency.",
                        "Web Services & API Support: Implemented access and resolved issues with Web Services and API, utilizing tools like OpenSSL, OpenPGP, SOAP/REST protocols, WSDL files, JSON/XML data, OAuth, and OpenID.",
                        "Documentation: Actively documented issue identification tips, error resolution strategies, and FAQs related to Web Services and API capabilities.",
                        "Team Assistance: Provided training and guidance for Web Services/API support while assisting team members with service cases."
                    ]
                },
                {
                    "position": "Technical Solutions Consultant",
                    "startDate": "2012-02-01",
                    "endDate": "2013-10-01",
                    "highlights": [
                        "Client Support: Provided technical assistance to clients for resolving product hardware, software, and operating system issues through phone and remote access for supported applications or products.",
                        "Issue Analysis: Analyzed client issues to determine resolution feasibility on initial contact or required escalation to second-level support.",
                        "Upgrades & Problem Resolution: Supported installation upgrades and resolved technical problems related to performance, security, and other product concerns.",
                        "Troubleshooting & Workarounds: Effectively identified, replicated, and developed solutions for client issues, documenting and communicating results to clients and Corporate Development.",
                        "Database Expertise: Delivered advanced technical expertise for standard database applications, including MS Access, Oracle, MySQL, MS SQL Server, and more.",
                        "Lab Scenario Recreation: Gathered client databases and variables, recreating scenarios in a PC Lab environment to resolve complex database issues.",
                        "Product Pilot Assistance: Assisted in new product pilots and rollouts to departments and clients, ensuring smooth transitions and implementation.",
                        "Cross-Functional Liaison: Acted as a liaison between Implementation, Client Services, Management, and Corporate Support to resolve high-impact problems swiftly and effectively.",
                        "Training Development: Identified department training needs, assisting in the creation of training development programs.",
                        "Team Leadership: Served as team leader in the manager's absence, prioritizing critical issues, providing direction, and ensuring timely, effective client support.",
                        "Technical Proficiency: Developed expertise across networks, operating systems, hardware, software, databases, browsers, and related technologies.",
                        "Documentation Creation: Supported product enhancements by developing internal documentation for new features and procedures."
                    ]
                },
                {
                    "position": "Connection Services Specialist",
                    "startDate": "2008-05-01",
                    "endDate": "2012-02-01",
                    "highlights": [
                        "Technical Support: Collaborated with team members to provide solutions and answer inquiries regarding ADP HR/Benefits Solution, ADP Payroll products, Microsoft products, and other related software packages for the National HR & Benefit Services client base.",
                        "Data File Delivery: Maintained delivery of data files in formats like XML, JSON, ANSI 834 4010/5010, CSV, and Tab Delimited to ensure precise employee-level benefit plan enrollment.",
                        "Client Communication: Fostered effective communication with ADP clients to ensure satisfaction and improvements in client retention.",
                        "Troubleshooting & Workarounds: Troubleshot and replicated client issues, developing workarounds and providing efficient resolutions.",
                        "Training & Procedure Recommendations: Assisted in training initiatives, recommending new procedures and methods to enhance team performance.",
                        "HRB Extend API Support: Implemented and troubleshot HRB Extend API for alternative data transfer methods, leveraging knowledge of WSDL files and XML data transfers.",
                        "OpenSSL Utilization: Used OpenSSL to confirm the correct format and encryption level of Certificates and Certificate Signing Requests.",
                        "Web Services Training: Provided extensive training for Web Services support team members and assisted in resolving service cases.",
                        "Documentation Management: Actively maintained documentation for client support, including troubleshooting tips, error resolution strategies, and FAQs regarding API capabilities."
                    ]
                },
                {
                    "position": "HRIS Support Specialist",
                    "startDate": "2007-04-01",
                    "endDate": "2008-05-01",
                    "highlights": [
                        "Consulting Expertise: Provided expert consultancy to service ADP's HR & Benefits products and technologies, delivering solutions tailored to client needs.",
                        "Problem-Solving: Leveraged broad expertise to identify and resolve client problems, delivering effective and innovative solutions with direction.",
                        "Product Mastery: Developed and maintained deep knowledge of ADP's products and services to address client questions, exceed expectations, and showcase the value of ADP's offerings.",
                        "Recommendations to Leadership: Provided insights and recommendations to ADP leadership on best practices and training opportunities, informed by client input and personal experience."
                    ]
                }
            ]
        },
        {
            "name": "CEVA Logistics",
            "position": "Import Operations Assistant II",
            "url": "https://www.cevalogistics.com",
            "startDate": "2000-01-01",
            "endDate": "2007-01-01",
            "highlights": [
                "Document Scanning: Scanned import documentation for Nike using Accent Capture software while adhering to strict quality standards and accuracy.",
                "Data Indexing: Indexed documents into a web-based database for customer review and utilized an AS/400 system for updates and shipment queries.",
                "System Maintenance: Performed routine maintenance on Kodak 3500 Scanner and created sales and marketing presentations on product capabilities.",
                "Manual Development: Authored the scanning system manual, ensured updates aligned with ISO procedures, and maintained instructional guides to enable seamless operations during absences.",
                "Troubleshooting Support: Updated troubleshooting guides based on evolving challenges and queries from coworkers.",
                "File Storage Management: Managed warehouse file storage spanning five years, rotating files from the main office as space limitations arose."
            ]
        },
        {
            "name": "Burnham Services Corp",
            "position": "NCR Corporate Account Lead",
            "startDate": "1998-01-01",
            "endDate": "2000-01-01",
            "highlights": [
                "Customer Relationship Management: Established and maintained working relationships with NCR technicians to better address customer needs and requirements.",
                "Task Coordination: Managed daily operations based on customer needs, coordinating work crews to ensure efficient fulfillment.",
                "Shipping & Receiving: Utilized the AS/400 program and Microsoft software (Word, Excel, Access) to manage shipping and receiving processes.",
                "Equipment Operation: Operated forklifts, palletized boxes, and loaded trailers to streamline logistical operations.",
                "On-Call Support: Provided after-hours paging services for technicians to address urgent or unexpected situations."
            ]
        },
        {
            "name": "NCR Corporation",
            "position": "Logistics Associate",
            "startDate": "1996-01-01",
            "endDate": "1998-01-01",
            "highlights": [
                "Shipping & Receiving: Utilized various computer programs, including Microsoft Win95, Excel, and Access, to manage shipping and receiving operations.",
                "Training & Certifications: Completed HAZMAT and EH&S training to ensure compliance with safety standards.",
                "Forklift Operations & Inventory Control: Conducted forklift operations, maintained inventory control, and audited stock for accuracy.",
                "MSDS Management: Prepared and maintained Material Safety Data Sheets (MSDS) and participated in training sessions.",
                "Palletizing & Trailer Loading: Efficiently palletized boxes and loaded trailers for transport.",
                "Foam-in-Place Equipment: Operated foam-in-place chemical equipment for specialized packaging needs."
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "Code for Good",
            "position": "Technical Lead",
            "url": "https://codeforgood.org",
            "startDate": "2019-01-01",
            "summary": "Leading development of open-source projects for non-profit organizations.",
            "highlights": [
                "Built donation platform that raised $500K+ for local charities",
                "Mentored 20+ volunteer developers on best practices",
                "Organized monthly coding workshops for underrepresented groups"
            ]
        }
    ],
    "education": [
        {
            "institution": "Washington State University",
            "url": "https://wsu.edu",
            "area": "Management Information Systems",
            "studyType": "Bachelor of Arts",
            "startDate": "2011-09-01",
            "endDate": "2015-05-31",
            "courses": []
        },
		{
            "institution": "ITT Technical Institute",
            "area": "Computer Information Sciences",
            "studyType": "Associate of Arts",
            "startDate": "2001-01-01",
            "endDate": "2003-01-01",
            "courses": []
        }
    ],
    "awards": [],
    "certificates": [
        {
            "name": "Docusign eSignature API Pro",
            "date": "2023-04-18",
            "issuer": "Credly",
            "url": "https://www.credly.com/badges/9dedc2fc-f059-4084-9766-c7b315f2a425/public_url"
        },
        {
            "name": "Docusign Organization Management Pro",
            "date": "2023-04-10",
            "issuer": "Credly",
            "url": "https://www.credly.com/badges/f6312cbb-754d-4d1f-8136-86d3c7ac5a80/public_url"
        },
        {
            "name": "Docusign eSignature Administration Pro",
            "date": "2023-04-06",
            "issuer": "Credly",
            "url": "https://www.credly.com/badges/8f60c29a-06a4-40ac-9efb-9741f38c4ce1/public_url"
        },
        {
            "name": "Docusign eSignature Template Pro",
            "date": "2023-04-05",
            "issuer": "Credly",
            "url": "https://www.credly.com/badges/9fd1a3e6-e5c1-4781-83c7-46c1eb482f98/public_url"
        }
    ],
    "publications": [],
    "skills": [
        {
            "name": "Frontend Development",
            "level": "Expert",
            "keywords": [
                "JavaScript",
                "TypeScript",
                "jQuery",
                "HTML5",
                "CSS3",
                "Sass",
                "Webpack",
                "Grunt"
            ]
        },
        {
            "name": "Backend Development",
            "level": "Expert",
            "keywords": [
                "Node.js",
                "PHP",
                "REST APIs",
                "Microservices"
            ]
        },
        {
            "name": "Database & Cloud",
            "level": "Advanced",
            "keywords": [
                "MySql/MariaDB",
                "PostgreSQL",
                "MongoDB",
                "Redis",
                "AWS",
                "Docker",
                "Kubernetes",
                "CI/CD"
            ]
        },
        {
            "name": "Frameworks and CMS",
            "level": "Advanced",
            "keywords": [
                "CodeIgniter",
                "Phalcon",
                "CakePHP",
                "Laravel",
                "Symfony",
                "Joomla",
                "WordPress",
                "Blogger"
            ]
        }
    ],
    "languages": [],
    "interests": [
        {
            "name": "Open Source"
        },
        {
            "name": "Gaming"
        },
        {
            "name": "Cycling"
        },
        {
            "name": "Hiking"
        },
		{
            "name": "Snowboarding"
        },
		{
            "name": "Cooking"
        },
		{
            "name": "Travel"
        }
		
    ],
    "references": [],
    "projects": [
        {
            "name": "Hono Authentication",
            "description": "Developed and currently maintain a Hono Framework based application (HonoShield) which aims to simplify developing user authentication applications in the Cloudflare workers space. Site visitors are able to register, login/logout, and modify their user records.",
            "highlights": [],
            "keywords": [
                "JavaScript",
                "Hono",
                "NPM",
                "Cloudflare",
				"Wrangler",
				"Github"
			
            ],
            "startDate": "2024-01-01",
            "endDate": "2022-06-30",
            "url": "https://honoshield.cdndev.io",
            "roles": [
                "Lead Developer",
                "Architect"
            ],
            "entity": "Open Source",
            "type": "application"
        },
        {
            "name": "Stripe Payments Plugin",
            "description": "Created a repository demonstrates how to integrate Stripe Payments with Cloudflare Workers using KV storage for securely managing keys, and submitting transactions to Resellerclub. It includes both the front-end (payment form with Stripe Elements) and back-end logic (payment intent creation, checksum generation, and form submission).",
            "highlights": [],
            "keywords": [
                "JavaScript",
                "Github",
				"Cloudflare",
				"Wrangler",
                "ResellerClub"
            ],
            "startDate": "2024-09-01",
            "url": "https://github.com/JamesShaver/stripepayments",
            "roles": [
                "Lead Developer",
                "Architect"
            ],
            "entity": "Open Source",
            "type": "application"
        },
		{
            "name": "Joomla Development",
            "description": "Working on a component/module/plugin combination to create a Joomla platform for white-label web hosting and domain name sales through a REST API backend service, as well utilizing a payment gateway library to handle sales.",
            "highlights": [],
            "keywords": [
				"Joomla",
                "PHP",
                "MySql",
				"Apache",
				"Nginx",
				"HTML",
				"Visual Studio Code",
				"REST API",
				"Postman",
				"Github",
                "ResellerClub"
            ],
            "startDate": "2001-09-01",
            "roles": [
                "Lead Developer",
                "Architect"
            ],
            "entity": "Open Source",
            "type": "application"
        },
		{
            "name": "Family Blogs",
            "description": "Developed and maintained themes and plugins for our family's self-hosted Wordpress blogs.",
            "highlights": [],
            "keywords": [
				"WordPress",
                "PHP",
                "MySql",
				"Apache",
				"Nginx",
				"HTML",
				"Visual Studio Code",
				"Github"
            ],
            "startDate": "2005-01-01",
            "roles": [
                "Lead Developer",
                "Architect"
            ],
            "entity": "Open Source",
            "type": "application"
        },
		{
            "name": "Self-Learning CNC Routing",
            "description": "Currently learning about 3D modeling and CNC routing with a tabletop CNC router and Fusion360 software",
            "highlights": [],
            "keywords": [
				"Genmitsu CNC 3018-PRO Router",
                "Autodesk Fusion 360",
                "Gimp",
				"Carbide Create",
				"Inkscape"
            ],
            "startDate": "2023-01-01",
            "roles": [
                "Lead Developer",
                "Architect"
            ]
        }
    ]
}